from fastapi import FastAPI
from fastapi.middleware.cors import CORSMiddleware

from . import controllers

app = FastAPI(
    title="Задание",
    description="""
Интернет-магазин подарков хочет запустить акцию в разных регионах. Чтобы
стратегия продаж была эффективной, необходимо произвести анализ рынка.

У магазина есть поставщик, регулярно присылающий выгрузки данных с информацией
о жителях. Проанализировав их, можно выявить спрос на подарки в разных городах
у жителей разных возрастных групп по месяцам.

Cервис сохраняет переданные ему наборы данных (выгрузки от поставщика) c
жителями, позволяет их просматривать, редактировать информацию об отдельных
жителях, а также производить анализ возрастов жителей по городам и
анализировать спрос на подарки в разных месяцах для указанного набора данных.

Реализована возможность загрузить несколько независимых наборов данных с
разными идентификаторами, независимо друг от друга изменять и анализировать
их.
"""
)

app.add_middleware(
    CORSMiddleware,
    allow_origins=["*"],
)

app.include_router(
    controllers.router,
    prefix="/imports"
)
